# Generated by brew-dump.sh on 2025年 7月28日 星期一 10时41分00秒 CST


brew "direnv"
brew "git"
brew "go"
brew "gradle"
brew "jenv"
brew "kotlin"
brew "mas"
brew "node"
brew "openjdk@21"
brew "pyenv"
brew "uv"
cask "clash-verge-rev"
cask "docker-desktop"
cask "google-chrome"
cask "iterm2"
cask "raycast"
cask "snipaste"
cask "stats"
cask "wechat"
mas "Bitwarden", id: 1352778147
tap "homebrew/bundle"
