# Brewfile - A Template for Your macOS Setup
# -------------------------------------------
#
# This file is a template. Uncomment the lines for the software you want to install.
# Add your own choices here.
#
# Learn more: https://github.com/Homebrew/homebrew-bundle

# Official taps (repositories)

# --- Command-Line Tools ---
# Essential for development. Uncomment what you need.
brew "git"
brew "node"
brew "kotlin"
brew "gradle"
brew "openjdk@21"
brew "pyenv"
brew "jenv"
brew "direnv"
# brew "wget"
brew "mas" # Required for Mac App Store apps below

# --- GUI Applications (Casks) ---
# Your daily-use applications. Uncomment to install.
cask "google-chrome"
# cask "visual-studio-code"
cask "iterm2"
# cask "rectangle" # Window manager
# cask "spotify" # Music
cask "wechat" # Chat
cask "raycast" # Chat
cask "stats" # mac stats app
# cask "tencent-meeting" # Meetings

# --- Fonts ---
# Useful for terminals and editors.
# cask "font-fira-code-nerd-font"

# --- Mac App Store Apps ---
# To use this, you must uncomment `brew "mas"` above.
# Then, find app IDs with `mas search <app_name>`.
# mas "WeChat", id: 836500024
mas "Bitwarden", id: 1352778147